Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelCorruption Property
 Can't create Curtain Panel. A Panel or a Mullion is probably too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCurtainPanelCorruption { get; }
Public Shared ReadOnly Property CannotCreateCurtainPanelCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCurtainPanelCorruption {
	FailureDefinitionId^ get ();
}
static member CannotCreateCurtainPanelCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace